;; -*- no-byte-compile: t; -*-
;;; config/default/packages.el

(package! avy)
(package! ace-link)
(package! dts-mode)
(package! ctags-update)
(package! evil-commentary)
(package! phpactor)
(package! yasnippet)
(package! yasnippet-snippets)
(package! multi-compile)
(package! browse-kill-ring)
(package! clipmon)
(package! cider)
(package! sclang-extensions)
(package! sclang-snippets)
(package! w3m)
(package! dired-imenu)
(package! cyberpunk-2019-theme)
(package! interaction-log)
(package! visual-fill-column)
(package! helm-recoll)
(package! find-file-in-project)
(package! org-ref)
(package! bookmark+ :recipe (:host github :repo "fnoon/BookmarkPlus"))

(package! system-packages)
(package! helm-system-packages)
;; (package! arch-packer)

(package! systemd)
(package! helm-systemd)

(package! web-search)
(package! nofrils-acme-theme)
(package! plan9-theme)
(package! load-theme-buffer-local)

(package! evil-cleverparens)
(package! lispyville)

(package! projectile)
;; (package! perspective)
(package! persp-mode)
(package! persp-projectile)

(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)
(package! lsp-ivy)
;; (package! lsp-intellij)

(package! all-the-icons-dired)
(package! dired-rainbow)
(package! dired+ :recipe (:host github :repo "emacsmirror/dired-plus"))
