;; -*- no-byte-compile: t; -*-
;;; config/default/packages.el

;; (package! company)
;; (package! company-box)

;; (package! counsel-dash)
;; (package! counsel-projectile)

;; (package! all-the-icons-ivy)
;; (package! ivy-hydra)
;; (package! ivy-rich)
;; (package! ivy-xref)
;; (package! posframe)
;; (package! ivy-posframe)
;; (package! amx)

;; (package! wgrep)

;; (package! anzu)
;; (package! evil-anzu)
(package! doom-modeline)
;; (package! shrink-path)
;; (package! spaceline)
(package! spaceline-all-the-icons)

(package! avy)
(package! ace-link)
(package! dts-mode)
(package! ctags-update)
(package! evil-commentary)
(package! phpactor)
(package! yasnippet)
(package! yasnippet-snippets)
(package! multi-compile)
(package! browse-kill-ring)
(package! clipmon)
(package! cider)
(package! sclang-extensions)
(package! sclang-snippets)
(package! w3m)

(package! cyberpunk-2019-theme)
(package! acme-theme)

(package! interaction-log)
(package! visual-fill-column)
(package! helm-recoll)
(package! find-file-in-project)

(package! org-ref)
;; (package! org-roam :recipe (:host github :repo "jethrokuan/org-roam"))

(package! bookmark+ :recipe (:host github :repo "fnoon/BookmarkPlus"))

(package! system-packages)
(package! helm-system-packages)
;; (package! arch-packer)

(package! systemd)
(package! helm-systemd)

(package! web-search)
(package! nofrils-acme-theme)
(package! plan9-theme)
(package! load-theme-buffer-local)

(package! evil-cleverparens)
(package! lispy)

(package! projectile)
;; (package! perspective)
(package! persp-mode)
(package! persp-projectile)

(package! lsp-mode)
(package! lsp-ui)
(package! company-lsp)
(package! lsp-ivy)
;; (package! lsp-intellij)

(package! all-the-icons-dired)
(package! dired-imenu)
(package! dired-rainbow)
(package! dired-ranger)
(package! dired-filter)
(package! dired-du)
(package! dired+ :recipe (:host github :repo "emacsmirror/dired-plus"))
(package! highlight)

(package! smart-tabs-mode)

(package! deft)

(package! auto-compile)

(package! all-the-icons-ibuffer)

(package! explain-pause-mode :recipe (:host github :repo "lastquestion/explain-pause-mode"))

(package! daemons)

;; (package! pretty-mode)

(package! names)

(package! exwm)

(package! sx)

(package! md4rd)

(package! magithub)

(package! quelpa)

(package! queue)

(package! all-the-icons-gnus)
(package! nnhackernews)

(package! wordnut)

(package! xwwp)
